//=============================================================================
//
// マップアイコン処理 [mapicon.h]
// Author : Eisuke Sakagawa
//
//=============================================================================
#ifndef _MAPICON_H_
#define _MAPICON_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"		// メイン
#include "manager.h"	// マネージャー
#include "scene3d.h"	// シーン3D

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CMapIcon : public CScene3D
{// マップアイコン（親：CScene3D）
public:
	CMapIcon(int nPriority);		// コンストラクタ
	~CMapIcon();					// デストラクタ

	static HRESULT Load(void);		// ロード
	static void Unload(void);		// アンロード

									// 生成
	static CMapIcon *Create(int nPriority, D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size, D3DXCOLOR col);

	HRESULT Init(void);				// 初期化処理
	void Uninit(void);				// 終了処理
	void Update(void);				// 更新処理
	void Draw(void);				// 描画処理

private:

protected:

};

#endif