//=============================================================================
//
// メニュー処理 [menu.h]
// Author : Eisuke Sakagawa
//
//=============================================================================
#ifndef _MENU_H_
#define _MENU_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"		// メイン
#include "scene.h"		// シーン

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MENU_MAX_TEXTURE	(4)			// メニューの最大数
#define MENU_SIZE_X			(100)		// 大きさ（X)
#define MENU_SIZE_Y			(30)		// 大きさ（Y)

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene3D;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CMenu : public CScene
{// ポーズ（親：CScene）
public:
	CMenu();									// コンストラクタ
	~CMenu();									// デストラクタ

	static HRESULT Load(void);					// ロード
	static void Unload(void);					// アンロード
	static CMenu *Create(void);					// 生成

	HRESULT Init(void);							// 初期化処理
	void Uninit(void);							// 終了処理
	void Update(void);							// 更新処理
	void Draw(void);							// 描画処理

private:
	static LPDIRECT3DTEXTURE9 m_apTexture;		// テクスチャ情報へのポインタ
	CScene3D *m_apScene3D[MENU_MAX_TEXTURE];	// シーン3D

	int m_nSelectNum;							// 選択番号
	int m_nCntTimer;							// 時間カウント

protected:

};

#endif