//=============================================================================
//
// レンダラー処理 [renderer.h]
// Author : Eisuke Sakagawa
//
//=============================================================================
#ifndef _RENDERER_H_
#define _RENDERER_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"		// メイン

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CRenderer
{// レンダラー
public:
	CRenderer();								// コンストラクタ
	~CRenderer();								// デストラクタ

	HRESULT Init(HWND hWnd, bool bWindow);		// 初期化処理
	void Uninit(void);							// 終了処理
	void Update(void);							// 更新処理
	void Draw(void);							// 描画処理

	LPDIRECT3DDEVICE9 GetDevice(void) { return m_pD3DDevice; }	// デバイス取得

private:
#ifdef _DEBUG
	void DrawFPS(void);							// FPS描画処理
#endif

	LPDIRECT3D9				m_pD3D;				// Direct3Dオブジェクト
	LPDIRECT3DDEVICE9		m_pD3DDevice;		// Deviceオブジェクト(描画に必要)

#ifdef _DEBUG
	LPD3DXFONT				m_pFont = NULL;		// フォントへのポインタ
#endif

protected:

};

#endif