//=============================================================================
//
// チュートリアル処理 [tutorial.h]
// Author : Eisuke Sakagawa
//
//=============================================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"		// メイン
#include "manager.h"	// マネージャー

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene2D;			// シーン2D
class CPause;			// ポーズ

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTutorial
{// チュートリアル
public:
	CTutorial();					// コンストラクタ
	~CTutorial();					// デストラクタ

	static HRESULT Load(void);		// ロード
	static void Unload(void);		// アンロード

	HRESULT Init(void);				// 初期化処理
	void Uninit(void);				// 終了処理
	void Update(void);				// 更新処理
	void Draw(void);				// 描画処理

	static void SetPause(bool bPause);					// ポーズ設定
	static bool GetPause(void) { return m_bPause; }	// ポーズ取得

private:
	static LPDIRECT3DTEXTURE9		m_pTexture;						// テクスチャ情報へのポインタ
	static CScene2D					*m_pScene2D[MAX_PLAYER];		// シーン2D

	static CPause *m_pPause;		// ポーズ
	static bool m_bPause;			// ポーズしているか

	void SetMap(void);				// マップ設定

	int m_mapfield;					// フィールド番号
	int m_mapfieldOld;				// フィールド番号

protected:

};

#endif