//=========================================================================================================================
// 
// サウンド処理 [sound.h]
// Author : AKIRA TANAKA
// 
//=========================================================================================================================
#ifndef _SOUND_H_
#define _SOUND_H_

//*************************************************************************************************************************
// インクルードファイル
//*************************************************************************************************************************
#include "main.h"	// メイン

//****************************************************
// サウンドファイル
//****************************************************
typedef enum
{
	SOUND_LABEL_BGM000 = 0,		// BGMタイトル
	SOUND_LABEL_BGM001,			// BGMバトルプロローグ
	SOUND_LABEL_BGM002,			// BGMバトルループ
	SOUND_LABEL_BGM003,			// BGMバトルボス
	SOUND_LABEL_BGM004,			// BGMランキング
	SOUND_LABEL_SE_SHOT000,		// 弾発射音0
	SOUND_LABEL_SE_SHOT001,		// 弾発射音1
	SOUND_LABEL_SE_HIT000,		// ヒット音0
	SOUND_LABEL_SE_HIT001,		// ヒット音1
	SOUND_LABEL_SE_ITEMHIT000,	// アイテムヒット音
	SOUND_LABEL_SE_BULLETUP000,	// 弾変更音
	SOUND_LABEL_SE_EXPLOSION,	// 爆発音
	SOUND_LABEL_SE_DECIDE,		// 決定音
	SOUND_LABEL_SE_SELECT,		// 選択音
	SOUND_LABEL_SE_PAUSE,		// ポーズ音
	SOUND_LABEL_SE_CLEAR,		// ゲームクリア音
	SOUND_LABEL_SE_OVER,		// ゲームオーバー音
	SOUND_LABEL_MAX,
} SOUND_LABEL;

//*************************************************************************************************************************
// プロトタイプ宣言
//*************************************************************************************************************************
HRESULT InitSound(HWND hWnd);			// サウンド初期化処理
void UninitSound(void);					// サウンド終了処理
HRESULT PlaySound(SOUND_LABEL label);	// サウンド再生処理
void StopSound(SOUND_LABEL label);		// サウンド停止処理
void StopSound(void);					// サウンド全停止処理

#endif
