//=============================================================================
//
// ゲームフェード処理 [gamefade.h]
// Author : 佐藤安純　Sato_Asumi
//
//=============================================================================
#ifndef _GAMEFADE_H_
#define _GAMEFADE_H_

#include "main.h"
#include "game.h"

//=============================================================================
//	マクロ定義
//=============================================================================
#define INTERVAL_TIME		(60 * 10)						//画面切り替えの時間

//=============================================================================
// フェードの状態
//=============================================================================
typedef enum
{
	GAMEFADE_NONE = 0,		// 何もしていない状態
	GAMEFADE_IN,			// フェードイン状態
	GAMEFADE_OUT,			// フェードアウト状態
	GAMEFADE_MAX
} GAMEFADE;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitGameFade(GAMESTATE modeNext);
void UninitGameFade(void);
void UpdateGameFade(void);
void DrawGameFade(void);

void SetGameFade(GAMESTATE modeNext);
GAMEFADE GetGameFade(void);

#endif
