//=============================================================================
//
// リザルト [クリア] 処理 [result.h]
// Author : 佐藤安純　Sato_Aumi
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif
