//*****************************************************************************
//
//				背景の処理[bg.h]
//				Auther : Shun Yokomichi
//
//*****************************************************************************
#ifndef _BG_H_
#define _BG_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene3D;		// シーン３D

//*****************************************************************************
//		マクロ定義
//*****************************************************************************

//*****************************************************************************
//		クラス定義(背景)
//*****************************************************************************
class CBg : public CScene
{
public:
	CBg();						// コンストラクタ
	~CBg();						// デストラクタ
	HRESULT Init();				// 初期化処理
	void Uninit(void);			// 終了処理
	void Update(void);			// 更新処理
	void Draw(void);			// 描画処理

	//	静的メンバ関数
	static HRESULT Load(void);	//	読み込む関数(テクスチャ)
	static void Unload(void);	// 開放する関数(テクスチャ)
	static CBg * Create();		// クリエイト

private:
	static LPDIRECT3DTEXTURE9 m_pTexture;	// 共有テクスチャへのポインタ
	CScene3D *m_pScene;			// シーン３Dポインタ
	float m_mvoetex_x;			// UV移動量
};

#endif
