//*****************************************************************************
//
//				チュートリアルの処理[tutorial.h]
//				Auther : Shun Yokomichi
//
//*****************************************************************************
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene.h"		// シーン

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene2D;			// シーン2D
class CPress;

//*****************************************************************************
//		マクロ定義
//*****************************************************************************
#define PRESS_KEY		(6)		// 矢印の最大数

//*****************************************************************************
//		クラス定義(チュートリアル)
//*****************************************************************************
class CTutorial
{
public:
	CTutorial();
	~CTutorial();

	HRESULT Init();
	void Uninit(void);
	void Update(void);
	void Draw(void);

	//	静的メンバ関数
	static HRESULT Load(void);	//	読み込む関数(テクスチャ)
	static void Unload(void);	// 開放する関数(テクスチャ)

private:
	CScene2D	*m_pScene;	// シーンのポインタ
	int			m_nPress;	// 押した回数
	float		m_fTexX;	// textureのUV
	bool		m_bPress;	// 押されたかの判断
	bool		m_bmove;	// 進むか戻るかの判断

							// 静的メンバ変数
	static LPDIRECT3DTEXTURE9 m_pTexture;	// 共有テクスチャへのポインタ
	static CPress *m_apPress[PRESS_KEY];	// プレスボタンのポインタ
};

#endif
