//=========================================================================================================================
//
// リザルト処理 [result.cpp]
// Author : Eisuke Sakagawa
//
//=========================================================================================================================

//*************************************************************************************************************************
// インクルードファイル
//*************************************************************************************************************************
#include "result.h"
#include "window.h"
#include "score.h"
#include "shadow.h"
#include "xplayer.h"
#include "light.h"
#include "camera.h"
#include "fade.h"
#include "input.h"

//*************************************************************************************************************************
// グローバル変数
//*************************************************************************************************************************
int				g_nCntResultTimer;		// タイマー

//=========================================================================================================================
// リザルトの初期化処理
//=========================================================================================================================
void InitResult(void)
{
	// 初期化
	g_nCntResultTimer = 0;

	// 破棄
	DeleteWindow(WINDOWTEXTURE_RESULT_BG);
	DeleteWindow(WINDOWTEXTURE_GAME_MAP_POS);
	DeleteWindow(WINDOWTEXTURE_GAME_MAP);
	DeleteWindow(WINDOWTEXTURE_GAME_HPBG); 
	DeleteWindow(WINDOWTEXTURE_GAME_HP); 
	DeleteWindow(WINDOWTEXTURE_GAME_HP_M);

	// カメラの初期化処理
	InitCamera();
	SetCamera(D3DXVECTOR3(0.0f, 80.0f, -280.0f), D3DXVECTOR3(0.0f, 80.0f, 0.0f), CAMERATYPE_RESULT);

	// ライトの初期化処理
	InitLight();

	// 影の初期化処理
	InitShadow();

	// プレイヤーの初期化処理
	InitXPlayer();

	SetXPlayer(D3DXVECTOR3(-80.0f, 0.0f, 0.0f), D3DXVECTOR3(0.0f, -0.3f, 0.0f));
}

//=========================================================================================================================
// リザルトの終了処理
//=========================================================================================================================
void UninitResult(void)
{
	// カメラの終了処理
	UninitCamera();

	// ライトの終了処理
	UninitLight();

	// 影の終了処理
	UninitShadow();

	// プレイヤーの終了処理
	UninitXPlayer();

	// スコアの終了処理
	SetRankingScore();
	UninitScore();

	DeleteWindow();
}

//=========================================================================================================================
// リザルトの更新処理
//=========================================================================================================================
void UpdateResult(void)
{
	// カメラの更新処理
	UpdateCamera();

	// ライトの更新処理
	UpdateLight();

	// 影の更新処理
	UpdateShadow();

	// プレイヤーの更新処理
	UpdateXPlayer();

	// スコアの更新処理
	UpdateScore();

	g_nCntResultTimer++;

	if ((GetKeyboardTrigger(DIK_RETURN) == true || GetKeyboardTrigger(DIK_Z) == true ||
		GetButtonTrigger(2) == true) || g_nCntResultTimer > 300)
	{// ランキングへ
		SetFadeMode(MODE_RANKING);
	}
}

//=========================================================================================================================
// リザルトの描画処理
//=========================================================================================================================
void DrawResult(void)
{
	// カメラの設定
	SetUpCamera();

	// 影の描画処理
	DrawShadow();

	// プレイヤーの描画処理
	DrawXPlayer();

	// スコアの描画処理
	DrawScore();
}
