//=========================================================================================================================
// 
// フェードの処理 [fade.h]
// Author : Eisuke Sakagawa
// 
//=========================================================================================================================
#ifndef _FADE_H_
#define _FADE_H_

//*************************************************************************************************************************
// インクルードファイル
//*************************************************************************************************************************
#include "main.h"
#include "game.h"		// ゲーム

//*************************************************************************************************************************
// 構造体定義
//*************************************************************************************************************************
typedef enum
{// フェード種類
	FADETYPE_NONE = 0,	// 使用していない
	FADETYPE_NORMAL,	// ノーマル
	FADETYPE_MODE,		// モード
	FADETYPE_GAME,		// ゲーム
	FADETYPE_MAX,
}FADETYPE;

typedef enum
{// フェード状態
	FADE_NONE = 0,		// 何もしていない状態
	FADE_IN,			// フェードイン状態
	FADE_OUT,			// フェードアウト状態
	FADE_MAX
} FADE;

//*************************************************************************************************************************
// プロトタイプ宣言
//*************************************************************************************************************************
void InitFade(MODE modeNext);		// フェード初期化処理
void UninitFade(void);				// フェード終了処理
void UpdateFade(void);				// フェード更新処理
void DrawFade(void);				// フェード描画処理

void SetFadeMode(MODE modeNext);		// フェードモード設定処理
void SetFadeGame(GAMESTATE gameNext);	// フェードゲーム設定処理
FADE GetFade(void);					// フェード取得処理

#endif