//=========================================================================================================================
// 
// ゲーム処理 [game.h]
// Author : Eisuke Sakagawa
// 
//=========================================================================================================================
#ifndef _GAME_H_
#define _GAME_H_

//*************************************************************************************************************************
// インクルードファイル
//*************************************************************************************************************************
#include "main.h"

//*************************************************************************************************************************
// 構造体定義
//*************************************************************************************************************************
typedef enum
{// ゲーム状態
	GAMESTATE_NONE = 0,		// 何もしていない状態
	GAMESTATE_MAP,			// マップ表示
	GAMESTATE_GAMEPLAY,		// ゲーム表示
	GAMESTATE_GAMECLEAR,	// ゲームクリア
	GAMESTATE_GAMEOVER,		// ゲームオーバー
	GAMESTATE_MAX
}GAMESTATE;

typedef enum
{// ステージ
	GAMESTAGE_NO1 = 0,		// ステージ１
	GAMESTAGE_NO2,			// ステージ２
	GAMESTAGE_NO3,			// ステージ３
	GAMESTAGE_NO4,			// ステージ４
	GAMESTAGE_NO5,			// ステージ５
	GAMESTAGE_MAX
}GAMESTAGE;

//*************************************************************************************************************************
// プロトタイプ宣言
//*************************************************************************************************************************
void InitGame(void);							// ゲーム初期化処理
void UninitGame(void);							// ゲーム終了処理
void UpdateGame(void);							// ゲーム更新処理
void DrawGame(void);							// ゲーム描画処理

void SetGameState(GAMESTATE state);				// ゲーム設定処理
GAMESTATE GetGameState(void);					// ゲーム取得処理
void SetNumStage(int stage);					// ゲームステージ設定
GAMESTAGE GetNumStage(void);					// ゲームステージ取得
void SetStageClearState(void);					// ゲームステージクリア設定
bool *GetStageClearState(void);					// ゲームステージクリア取得
void SetPauseState(bool bPause);				// ポーズ状態設定
bool GetPauseState(void);						// ポーズ状態取得
void GameSoundStop(void);						// ゲームBGM停止

#endif